holoduke/korvo-1/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s31"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# PSRAM (16MB octal)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_250M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_MEMTEST=n
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536

CONFIG_FREERTOS_HZ=1000

# Keep Wi-Fi/LWIP code out of IRAM (IRAM overflows otherwise on this chip)
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
CONFIG_LWIP_IRAM_OPTIMIZATION=n

# LVGL
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DEF_REFR_PERIOD=15
CONFIG_LV_DPI_DEF=130

# Rendering performance
# PPA hardware acceleration is set at runtime (enable_ppa_accel).
CONFIG_ESP_LVGL_ADAPTER_ENABLE_FPS_STATS=y
CONFIG_LV_DRAW_SW_COMPLEX=y
# Dual-core parallel software rendering (fastest for this UI).
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=2
CONFIG_LV_DRAW_THREAD_STACK_SIZE=8192
# Cache resolved styles (big win for many static styled objects).
CONFIG_LV_OBJ_STYLE_CACHE=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_46=y

# SNTP for the clock
CONFIG_LWIP_SNTP_MAX_SERVERS=2
CONFIG_LV_USE_SNAPSHOT=y
CONFIG_LV_GRADIENT_MAX_STOPS=8
CONFIG_LV_USE_DRAW_SW_COMPLEX_GRADIENTS=y

# --- Reliability (2026-09-06 review) ---
# Bootloader rollback: a new OTA image must confirm itself (done once the HTTP
# server is up) or the bootloader falls back to the previous image.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
# Wi-Fi/IP event handlers touch LVGL and start services; 2304 B is too thin.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=8192
# Crash dumps to the 'coredump' partition (idf.py coredump-info to read).
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
# httpd needs max_open_sockets+3; leave room for HA websocket, SNTP, DNS.
CONFIG_LWIP_MAX_SOCKETS=16
# UI-originated HA sends must not wait behind the websocket receive loop.
CONFIG_ESP_WS_CLIENT_SEPARATE_TX_LOCK=y
# A task starving IDLE0 for 5 s (a driver spin at high priority) must reboot,
# not just log: with rollback enabled the bootloader then discards an
# unconfirmed image. Seen 2026-09-06: Wi-Fi task stuck in the SHA HAL.
CONFIG_ESP_TASK_WDT_PANIC=y
# Software SHA: the hardware SHA (DMA) engine hangs in sha_hal_wait_idle during
# the WPA handshake on the ESP32-S31 (intermittent, then every boot on
# 2026-09-06), spinning the Wi-Fi task at priority 23 forever. WPA only hashes
# a few KB, so software SHA costs nothing noticeable.
# CONFIG_MBEDTLS_HARDWARE_SHA is not set
# Task list + CPU usage for GET /api/tasks (live deadlock/starvation diagnosis).
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
# The RGB LCD vsync interrupt must survive flash writes (Wi-Fi NVS, OTA,
# otadata). As a non-IRAM interrupt it is masked/restored around every flash
# operation; on some boots (seen 2026-09-06) it never came back and the LVGL
# frame-buffer pipeline then waited forever for a vsync release (frozen UI).
CONFIG_LCD_RGB_ISR_IRAM_SAFE=y
